{
  "title": "Fors Sale-Single Family Home with Pool & Detached Studio",
  "price": "XCG 730,000",
  "location": "Grote Berg, Curaçao",
  "bedrooms": 3,
  "bathrooms": 2,
  "size": 715,
  "images": [
    "/assets/images/listings/cover.jpg"
  ],
  "description": "\nThis move-in-ready modern family residence is located in the sought-after area of Grote Berg, offering comfort, privacy, and excellent investment potential. Built on 715 m² of owned land, the property combines contemporary design with functional living spaces, ideal for both permanent residence and rental opportunities.\n\nThe main home features an open-plan layout with a spacious living and dining area, seamlessly connected to a gourmet kitchen designed for both daily living and entertaining. Large sliding doors open to a covered back porch, where you can enjoy cooling trade winds and peaceful sunset views overlooking the private swimming pool.\n\nA detached studio adds significant value, making this property attractive for short- or long-term rental income, a guest house, or a private home office.\n\n\nProperty Features:\nMain Residence:\n\n715 m² owned land\n\n3 air-conditioned bedrooms\n\n2 modern bathrooms, including a spacious en-suite\n\nOpen-plan living and dining area with air-conditioning\n\nLarge covered back porch with sunset views\n\n\nGourmet Kitchen:\n\nCooking island with integrated pop-up charging station\n\nBuilt-in wine cooler\n\nSeparate grill\n\nExtractor hood\n\nSoft-close drawers and cabinets\n\nIntegrated spice racks\n\nBuilt-in waste disposal system\n\n\nOutdoor & Additional Features:\n\nPrivate swimming pool\n\nDetached studio (ideal for rental income or guest accommodation)\n\nOutdoor storage room\n\nSeparate laundry area\n\nFurniture available for purchase\n\nRecent valuation report available\n\nMove-in ready condition\n\nLocation\nGrote Berg is a popular residential area on Curaçao, known for its quiet surroundings, good accessibility, and proximity to Willemstad, beaches, and major road connections. This makes the property suitable for families, professionals, and investors alike."
}